<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [158]:
import pandas as pd
import psycopg2

In [159]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [160]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [161]:
# текст запроса
query_3_1 = f'''
select count(*)
from public.vacancies
'''

In [162]:
# результат запроса
qty_vacs = pd.read_sql_query(query_3_1, connection)
qty_vacs

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\3061310285.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  qty_vacs = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [163]:
# текст запроса
query_3_2 = f'''
select count(*)
from public.employers
'''

In [164]:
# результат запроса
qty_emps = pd.read_sql_query(query_3_2, connection)
qty_emps

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\2077926347.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  qty_emps = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [165]:
# текст запроса
query_3_3 = f'''
select count(*)
from public.areas
'''

In [166]:
# результат запроса
qty_areas = pd.read_sql_query(query_3_3, connection)
qty_areas

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\3984862743.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  qty_areas = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [167]:
# текст запроса
query_3_4 = f'''
select count(*)
from public.industries
'''

In [168]:
# результат запроса
qty_inds = pd.read_sql_query(query_3_4, connection)
qty_inds

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\2605357788.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  qty_inds = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [169]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [170]:
# текст запроса
query_4_1 = f'''
select 
    count(v.id) as cnt,
    a.name
from public.vacancies as v
join public.areas as a on a.id = v.area_id
group by a.name
order by 1 desc
limit 5
'''

In [171]:
# результат запроса
cnt_areas = pd.read_sql_query(query_4_1, connection)
cnt_areas

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\2130435986.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cnt_areas = pd.read_sql_query(query_4_1, connection)

    cnt             name
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [172]:
# текст запроса
query_4_2 = f'''
select 
    count(id)
from public.vacancies
where (salary_from is not null) or (salary_to is not null)

'''

In [173]:
# результат запроса
sal_not_null = pd.read_sql_query(query_4_2, connection)
sal_not_null

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\1745129562.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sal_not_null = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [174]:
# текст запроса
query_4_3 = f'''
select 
    round(avg (salary_from)),
    round(avg (salary_to))
from public.vacancies

'''

In [175]:
# результат запроса
mid_sal = pd.read_sql_query(query_4_3, connection)
mid_sal

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\992741667.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  mid_sal = pd.read_sql_query(query_4_3, connection)

     round     round
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [176]:
# текст запроса
query_4_4 = f'''
select 
    schedule,
    count(schedule),
    employment,
    count (employment)
    
from public.vacancies
group by schedule, employment
order by 2 desc
'''

In [177]:
# результат запроса
shed_emp = pd.read_sql_query(query_4_4, connection)
shed_emp

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\3557182139.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  shed_emp = pd.read_sql_query(query_4_4, connection)

            schedule  count           employment  count
0        Полный день  35367     Полная занятость  35367
1   Удаленная работа   7802     Полная занятость   7802
2      Гибкий график   1593     Полная занятость   1593
3   Удаленная работа   1312  Частичная занятость   1312
4     Сменный график    940     Полная занятость    940
5        Полный день    569           Стажировка    569
6     Вахтовый метод    367     Полная занятость    367
7        Полный день    347  Частичная занятость    347
8      Гибкий график    312  Частичная занятость    312
9        Полный день    141     Проектная работа    141
10  Удаленная работа    133     Проектная работа    133
11     Гибкий график    116           Стажировка    116
12    Сменный график    101  Частичная занятость    101
13  Удаленная работа     64           Стажировка     64
14     Гибкий график     18     Проектная работа     18
15    Сменный график     12           Стажировка     12
16    Вахтовый метод      2     Проектная работа      2
17    Сменный график      1     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [178]:
# текст запроса
query_4_5 = f'''
select 
    experience,
    count (experience)
from public.vacancies
group by experience
having experience is not null
order by 2
'''

In [179]:
# результат запроса
exp = pd.read_sql_query(query_4_5, connection)
exp

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\4206237875.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  exp = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [180]:
# выводы по детальному анализу вакансий

1. Наибольшее количество вакансий размещено в Москве, Спб, Минске (условно столичные города), в наиболее крупном деловом центре Казахстана - Алма-Ате и, как ни странно, в Новосибирске. ТАким образом Новосибирск можно отнести к лидеру нестоличных центров по интенсивности рынка вакансий.
2. Половина работодателей не указывает уровень заработной платы, предпочитая опираться на зарплатные ожидания соискателя или озвучить размер оплаты труда на собеседовании.
3. Средние зарплаты на рынке от 71 до 110 тыс. рублей. Конечно, тут большое влияние столиц. Думаю, если исключить из выборки Мск и СПб, то уровень средней зарплаты упадет. На самом деле это еще и говорит о том, что работодатели предпоитают завышать уровень зарплаты: указывая ее размер или до вычета налогов, или после прохождения испытательного срока, или при достижении высоких, порой даже максимальных, плановых показателей.
4. Понятно, что большинство работодателей ищет сотрудников на полный рабочий день с условием полной занятости (как правило по определенному месту работы). После КОВИДа ситуация изменилась и на второе место вышел удаленный формат работы при условии полной занятости. В любом случае - полная занятость чаще всего интересует работодателей пр иразмещении вакансий на HH. Возможно, что это еще и вызвано тем, что объявления о стажировках, фрилансе, проектной работе размещаются на других, специализированных площадках.
5. Более половины работодателей ищут сотрудников без опыта работы (интересно соотнести, у скольки из них не указан уровень заработной платы). Меньше всего работодателей ищет опытных работников: в наше время опыт перестал быть ключевым навыком работников. Недавние исследования показали, что работодатели предпочитают уделять внимание так называемым софт-скиллс работника (навыкам обучаемости, коммуникации и прочим навыкам, которые не даются с опытом или специальностью).

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [181]:
# текст запроса
query_5_1 = f'''
select
e.name,
count(v.id)
from public.vacancies as v
join public.employers as e on v.employer_id = e.id
group by 1
order by 2 desc
limit 5
'''

In [182]:
# результат запроса
top_emp = pd.read_sql_query(query_5_1, connection)
top_emp

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\2005451803.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  top_emp = pd.read_sql_query(query_5_1, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [183]:
# текст запроса
query_5_2 = f'''
select
a.name "регион",
count(distinct e.id) "работодатели",
count(distinct v.id) "вакансии"

from public.areas as a
left join public.vacancies as v on v.area_id = a.id
left join public.employers as e on a.id = e.area
where v.id is null
group by a.name
order by 2 desc 
'''

In [184]:
# результат запроса
reg_emp = pd.read_sql_query(query_5_2, connection)
reg_emp

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\1455442594.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  reg_emp = pd.read_sql_query(query_5_2, connection)

                             регион  работодатели  вакансии
0                            Россия           410         0
1                         Казахстан           207         0
2                Московская область            75         0
3                Краснодарский край            19         0
4                          Беларусь            18         0
..                              ...           ...       ...
588                        Кувандык             0         0
589                        Куйбышев             0         0
590  Куйбышево (Ростовская область)             0         0
591                        Култаево             0         0
592                        Кульсары             0         0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [185]:
# текст запроса
query_5_3 = f'''
select

e.name,
count(distinct v.area_id)

from public.employers as e

join public.vacancies as v on e.id = v.employer_id


group by e.name

order by 2 desc 
'''

In [186]:
# результат запроса
emp_reg = pd.read_sql_query(query_5_3, connection)
emp_reg

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\2110899257.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  emp_reg = pd.read_sql_query(query_5_3, connection)

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
14761                  UniSol      1
14762            UNISTORY LLC      1
14763                   UNIT6      1
14764     United Distribution      1
14765              UNITEL LLC      1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [187]:
# текст запроса
query_5_4 = f'''
select
count(distinct e.id)

from public.employers as e
left join public.employers_industries as i on e.id = i.employer_id
where i.employer_id is null
'''

In [188]:
# результат запроса
emp_null_ind = pd.read_sql_query(query_5_4, connection)
emp_null_ind

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\4197506799.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  emp_null_ind = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [189]:
# текст запроса
query_5_5 = f'''
select
    e.name,
    count (i.industry_id)

from public.employers as e
join public.employers_industries as i on e.id = i.employer_id
group by e.name
having count (i.industry_id) = 4
order by 1
limit 1
offset 2

'''

In [190]:
# результат запроса
emp_4_ind = pd.read_sql_query(query_5_5, connection)
emp_4_ind

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\1569220574.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  emp_4_ind = pd.read_sql_query(query_5_5, connection)

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [191]:
# текст запроса
query_5_6 = f'''
select
    count (ei.employer_id)
from public.employers_industries as ei
join public.employers as e on e.id = ei.employer_id
join public.industries as i on ei.industry_id = i.id
where i.name = 'Разработка программного обеспечения'

'''

In [192]:
# результат запроса
emp_po = pd.read_sql_query(query_5_6, connection)
emp_po

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\598773717.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  emp_po = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [193]:
# код для получения списка городов-милионников
import requests
import pandas as pd
url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России'
html = requests.get(url).content
df = pd.read_html(html)
df_million = df[1]
df_million['Город'][13] = 'Воронеж' #убираю примечание из "Вронежа"
million_list = tuple(list(df_million['Город'])) #преобразую колонку в кортеж

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\3698316784.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_million['Город'][13] = 'Воронеж' #убираю примечание из "Вронежа"

In [194]:
# текст запроса
query_5_7 = f'''
with total as (select
    a.name,
    count(v.area_id)
from public.vacancies as v
join public.employers as e on e.id = v.employer_id
join public.areas as a on a.id = v.area_id
where e.name = 'Яндекс'
group by a.name
having a.name in {million_list}
)
select * from total
union all
select 'Total', sum(count)
from total
order by 2
'''

In [195]:
# результат запроса
yandex = pd.read_sql_query(query_5_7, connection)
yandex

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\53895879.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  yandex = pd.read_sql_query(query_5_7, connection)

               name  count
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7            Самара   26.0
8               Уфа   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            Total  485.0

***

**Выводы по анализу работодателей**
1. Самыми крупными работодателями являются российские технологические гиганты, такие как Яндекс, Тинькофф, Сбер, Ростелеком. Самая крупная газодобывающая компания Газпром явлется только 5-м работодателем по количеству вакансий.
2. При этом Яндекс и Ростелеком являются одними из лидеров по своему присутствию на всех территориях России и зарубежья (вакансии представлены в наибольшем количестве регионов).
3. Стоит обратить внимание на депрессивные территории, где не размещено ни одной вакансии, хотя работодатели присутствуют. Лидером среди таких территорий является "Россия", что говорит о том, что работодатели, попадаю в базу ХХб даже не потрудились указать конкретного регионального присутствия, либо работают без офиса (удаленно) на всей территории страны.
4. Более того, почти 8,5 тыс. работодателей не указали сферу своей деятельности.
5. Болле 3,5 тыс. компаний указали в качестве сферы своей деятельности - разработка программного обеспечения. Это около 15% всех работодателей, представленных на сайте ХХ.
6. Отдельно обращаем внимание на Яндекс, вакансии этой компании размещены во всех крупных городах России. Это самый крупный работодатель страны.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [196]:
# текст запроса
query_6_1 = f'''
select
    count(name)
    
from public.vacancies

where lower(name) like '%data%' or lower(name) like '%данн%'

'''

In [197]:
# результат запроса
data_count = pd.read_sql_query(query_6_1, connection)
data_count

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\2139227253.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data_count = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [198]:
# текст запроса
query_6_2 = f'''
select
    count(id)
    
from public.vacancies

where (lower(name) like '%data%scientist%' 
    or lower(name) like '%data%science%'
    or lower(name) like '%исследователь%данных%'
    or (name like '%ML%' and name not like '%HTML%')
    or lower(name) like '%machine%learning%'
    or lower(name) like '%машинн%обучен%')
    and
    (lower(name) like '%junior%'
    or experience = 'Нет опыта'
    or employment = 'Стажировка')
'''

In [199]:
# результат запроса
ds_junior_count = pd.read_sql_query(query_6_2, connection)
ds_junior_count

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\547695800.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  ds_junior_count = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [200]:
# текст запроса
query_6_3 = f'''
select
    count(id)
    
from public.vacancies

where (lower(name) like '%data%scientist%' 
    or lower(name) like '%data%science%'
    or lower(name) like '%исследователь%данных%'
    or (name like '%ML%' and name not like '%HTML%')
    or lower(name) like '%machine%learning%'
    or lower(name) like '%машинн%обучен%')
    and
    (key_skills like '%SQL%'
    or key_skills like '%postgres%')
'''

In [201]:
# результат запроса
ds_sql_postgres = pd.read_sql_query(query_6_3, connection)
ds_sql_postgres

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\3027539305.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  ds_sql_postgres = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [202]:
# текст запроса
query_6_4 = f'''
select
    count(id)
    
from public.vacancies

where (lower(name) like '%data%scientist%' 
    or lower(name) like '%data%science%'
    or lower(name) like '%исследователь%данных%'
    or (name like '%ML%' and name not like '%HTML%')
    or lower(name) like '%machine%learning%'
    or lower(name) like '%машинн%обучен%')
    and
    lower(key_skills) like '%python%'
    
'''

In [203]:
# результат запроса
cnt_python = pd.read_sql_query(query_6_4, connection)
cnt_python

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\2240921845.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cnt_python = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [204]:
# текст запроса
query_6_5 = f'''
with cnt as (
select
length(key_skills) - length(replace(key_skills, CHR(9), '')) + 1 as cnt_skills --главное додуматься до +1 )
    
    
from public.vacancies

where (lower(name) like '%data%scientist%' 
    or lower(name) like '%data%science%'
    or lower(name) like '%исследователь%данных%'
    or (name like '%ML%' and name not like '%HTML%')
    or lower(name) like '%machine%learning%'
    or lower(name) like '%машинн%обучен%')
    and (key_skills is not null))
select 
round(avg(cnt_skills),2)
from cnt

    
'''

In [205]:
# результат запроса
cnt_skills = pd.read_sql_query(query_6_5, connection)
cnt_skills

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\190346600.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cnt_skills = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [206]:
# текст запроса
query_6_6 = f'''

select
experience,
round(avg(COALESCE((salary_from + salary_to) / 2, salary_from, salary_to))) as avg_sal
    
from public.vacancies

where (lower(name) like '%data%scientist%' 
    or lower(name) like '%data%science%'
    or lower(name) like '%исследователь%данных%'
    or (name like '%ML%' and name not like '%HTML%')
    or lower(name) like '%machine%learning%'
    or lower(name) like '%машинн%обучен%')
    and (salary_from is not null or salary_to is not null)

group by   experience 
having experience = 'От 3 до 6 лет'
'''

In [207]:
# результат запроса
salary_exp = pd.read_sql_query(query_6_6, connection)
salary_exp

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\2263455759.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  salary_exp = pd.read_sql_query(query_6_6, connection)

      experience   avg_sal
0  От 3 до 6 лет  243115.0

***

In [208]:
# выводы по предметному анализу в блоке ниже

**выводы по предметному анализу**
1. 3,5% вакансий от всех, размещенных на сайте ХХ имеет отношение к данным (а это включает в себя и любой анализ данных, и data science в целом).
2. Только в 51-й вакансии ищут начинающих специалистов по ДС. То есть запрос преимущественно на более опытных специалистов, найти новичкам работу или стажировку по данному направлению становится сложно.
3. Среди всей дата-сайентистов более востребованы навыки Python, чем навыки SQL или postgres.
4. Учитывая количество навыков, которые указывают дата-сайентисты (более 6), сложно интерпретировать выводы из предыдущего пункта: скорее всего все ДС-специалисты указывают и навыки владения python, и SQL, но некоторые не указывают SQL (пока по не понятным для меня причинам). В идеале специалист ДС должен обладать обеими указанными навыками ,соответственно цифры должны быть примерно равны.
5. Мы видим, что средние зарплаты весьма высоки. ТАким образом при успешном прохождении конкурса, есть шанс получать неплохую зарплату. Однако надо помнить про высокую конкурентность на рынке и перенасыщенность рынка соискателями, считающими себя ДС-специалистами.

# Общий вывод по проекту

In [209]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, 
# продумать варианты продолжения исследования

**Дополнительное исследование**
Интересно посмотреть не только количество ДС-вакансий, но и количество вакансий, имеющих отношение в целом к IT. И уже после этого, посмотреть в них долю ДС-специалистов. Возьму перечень ключевых ИТ специальностей из своего предыдущего проекта-1.  
                ['системный администратор', 'разрабочик', 'devops', 'тестировщик', 
                  'сисадмин', 'дата', 'sql', 'программист', 'java', 'oracle', 'unix', 'xml',
                  'дизайн интерфейса', 'информационной', 'реинжиниринг', 'junior', 'middle', 'senior', 'developer', 
                  'frontend', 'backend', 'php', 'ux/ui', 'design', 'web', 'приложений', 'qa ', 'gamedev', 
                  'верстальщик', 'designer', 'product manager', 'ios', 'it ', 'аналитик данных', 'data ']

In [210]:
query_add = f'''
select
    count(id)
    
from public.vacancies

where (lower(name) like '%data%scientist%' 
    or lower(name) like '%data%science%'
    or lower(name) like '%исследователь%данных%'
    or (name like '%ML%')
    or lower(name) like '%machine%learning%'
    or lower(name) like '%машинн%обучен%')
    or lower(name) like '%dсистемный администратор%'
    or lower(name) like '%разрабочик%'
    or lower(name) like '%devops%'
    or lower(name) like '%тестировщик%'
    or lower(name) like '%сисадмин%'
    or lower(name) like '%дата%'
    or lower(name) like '%sql%'
    or lower(name) like '%программист%'
    or lower(name) like '%java%'
    or lower(name) like '%oracle%'
    or lower(name) like '%unix%'
    or lower(name) like '%xml%'
    or lower(name) like '%дизайн интерфейса%'
    or lower(name) like '%реинжиниринг%'
    or lower(name) like '%информационной%'
    or lower(name) like '%junior%'
    or lower(name) like '%middle%'
    or lower(name) like '%senior%'
    or lower(name) like '%developer%'
    or lower(name) like '%frontend%'
    or lower(name) like '%backend%'
    or lower(name) like '%php%'
    or lower(name) like '%ux/ui%'
    or lower(name) like '%design%'
    or lower(name) like '%web%'
    or lower(name) like '%приложений%'
    or lower(name) like '%qa %'
    or lower(name) like '%gamedev%'
    or lower(name) like '%верстальщик%'
    or lower(name) like '%designer%'
    or lower(name) like '%product manager%'
    or lower(name) like '%ios%'
    or lower(name) like '%it %'
    or lower(name) like '%аналитик данных%'
    or lower(name) like '%data %'
   
'''

it = pd.read_sql_query(query_add, connection)
it

C:\Users\u1\AppData\Local\Temp\ipykernel_8176\506548835.py:51: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  it = pd.read_sql_query(query_add, connection)

   count
0  19466

**Вывод по дополнительному исследованию**
1. Действительно, специалистов по информационным технологиям очень много, почти половина (точнее - 40%) размещенных вакансий из этой сферы.
2. Специалисты по данным занимают менее - это около 9% всех ит-специалистов (и только около 2,5% - если мы применяем более точные критерии из раздела 6 к ДС-специалистам).

**Общие выводы**

1. Рынок насыщен ИТ-специалистами, ищущими работу.
2. Оплата труда на этом рынке высокая, но работодателю есть из кого выбирать.
3. Попав в сферу ИТ можно неплохо себя обеспечить в жизни.
4. ДС является еще довольно редкой, но при этом хорошо оплачиваемой специальностью.